---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotUpdateWall
source: html/01168e9e-ef0d-a8de-cb47-5731c09973e6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotUpdateWall Property

Can't update Wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotUpdateWall { get; }
```